Docs/Evidence/P4-presentation/05b-mutation-interruption-ignored.diff
diff --git a/Source/GridlandsGame/Private/UI/GLSubtitles.cpp b/Source/GridlandsGame/Private/UI/GLSubtitles.cpp
index 2344612..c93e2b4 100644
--- a/Source/GridlandsGame/Private/UI/GLSubtitles.cpp
+++ b/Source/GridlandsGame/Private/UI/GLSubtitles.cpp
@@ -39,11 +39,7 @@ void FGLSubtitleQueue::Push(const FGLDialogueLine& Line, double Now, double Voic
 	if (Line.ExchangeId != CurrentExchange)
 	{
 		// A new exchange: anything left of the previous one was interrupted (the director decided).
-		Lines.RemoveAll([Now](const FGLSubtitle& S) { return S.Start > Now; });
-		for (FGLSubtitle& S : Lines)
-		{
-			S.End = FMath::Min(S.End, Now);
-		}
+		// MUTATION: interruptions are ignored (earlier exchanges keep playing)
 		CurrentExchange = Line.ExchangeId;
 	}
 	FGLSubtitle& S = Lines.AddDefaulted_GetRef();
