Docs/Evidence/P5-seamless-grid/21-planted-creature-without-invoker.diff
diff --git a/Source/GridlandsGame/Private/Combat/GLCreature.cpp b/Source/GridlandsGame/Private/Combat/GLCreature.cpp
index 0d04974..8d72418 100644
--- a/Source/GridlandsGame/Private/Combat/GLCreature.cpp
+++ b/Source/GridlandsGame/Private/Combat/GLCreature.cpp
@@ -33,6 +33,7 @@ AGLCreature::AGLCreature()
 	// Its reach (sight, hearing, leash) is at most 16 m in data: 32 m covers twice that.
 	NavInvoker = CreateDefaultSubobject<UNavigationInvokerComponent>(TEXT("NavInvoker"));
 	NavInvoker->SetGenerationRadii(3200.f, 4800.f);
+	NavInvoker->bAutoActivate = false; // PLANTED DEFECT: creatures rely on the player's navigation
 	Body = CreateDefaultSubobject<UStaticMeshComponent>(TEXT("Body"));
 	Body->SetupAttachment(GetCapsuleComponent());
 	Body->SetCollisionEnabled(ECollisionEnabled::NoCollision);
