Docs/Evidence/P7-visual-spike/mutations/M5-visual-ignores-collapse-pose.diff
--- a/Source/GridlandsGame/Private/Presentation/GLVisuals.cpp
+++ b/Source/GridlandsGame/Private/Presentation/GLVisuals.cpp
@@ -21,7 +21,7 @@
 	{
 		UStaticMeshComponent* Component = NewObject<UStaticMeshComponent>(Owner);
 		Component->SetStaticMesh(Mesh);
-		Component->SetupAttachment(Parent);
+		Component->SetupAttachment(Parent); Component->SetUsingAbsoluteLocation(true);
 		Component->SetCollisionEnabled(ECollisionEnabled::NoCollision);
 		Component->SetCanEverAffectNavigation(false);
 		Component->SetGenerateOverlapEvents(false);
