Docs/Evidence/P7-visual-spike/mutations/M6-unload-leaves-vegetation-behind.diff
--- a/Source/GridlandsGame/Private/World/GLPlacementSubsystem.cpp
+++ b/Source/GridlandsGame/Private/World/GLPlacementSubsystem.cpp
@@ -218,7 +218,7 @@
 	CellActors.RemoveAndCopyValue(CellId, Owned);
 	for (const TWeakObjectPtr<AActor>& Actor : Owned)
 	{
-		if (AActor* Live = Actor.Get())
+		if (AActor* Live = Actor.Get(); Live && !Live->IsA<AGLScatterPatch>())
 		{
 			Live->Destroy();
 			++Removed;
